---
kind: method
id: M:Autodesk.Revit.UI.TabbedDialogExtension.SetContextualHelp(Autodesk.Revit.UI.ContextualHelp)
source: html/2e8d9f99-6b4b-ad57-1994-f434ba1bfbf7.htm
---
# Autodesk.Revit.UI.TabbedDialogExtension.SetContextualHelp Method

Sets the contextual help.

## Syntax (C#)
```csharp
public void SetContextualHelp(
	ContextualHelp contextualHelp
)
```

## Parameters
- **contextualHelp** (`Autodesk.Revit.UI.ContextualHelp`) - The contextual help.